Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/atdf/PIC32CZ8110CA90208.atdf
        <register name="CALCTRL" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="SARCORE Calibration Value">
          <mode name="DEFAULT"/>
          <mode name="FUSES_ADC_SARCORE_12BIT_V7A0"/>
          <mode name="FUSES_ADC_SARCORE_12BIT_V7C0"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="en_cmbf" caption="Enable Common Mode Buffer" mask="0x1"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="en_dither" caption="Enable Dither" mask="0x4"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="dis_faz" caption="Disable auto-zeroing" mask="0x8"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="dis_saz" caption="Disable auto-zeroing" mask="0x10"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="dis_laz" caption="Disable auto-zeroing" mask="0x20"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="en_rdac" caption="Disable Power Cycling" mask="0x40"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="dbg_sel" caption="Debug Bus Select" mask="0x80"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="sel_del" caption="Scan Mode comp_out" mask="0x100"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="t1_dly" caption="Regen Latch Delay" mask="0x600"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="tclk_div" caption="Test Clock Divider" mask="0xF800"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="iadc_1" caption="Current Consumption 1" mask="0x300000"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="iadc_2" caption="Current Consumption 2" mask="0xC00000"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="icmp_1" caption="Bias Current Stage 1" mask="0x3000000"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="icmp_2" caption="Bias Current Stage 2" mask="0xC000000"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="icmbf" caption="Bias Current Common Mode Buffer" mask="0x30000000"/>
          <bitfield modes="FUSES_ADC_SARCORE_12BIT_V7A0 FUSES_ADC_SARCORE_12BIT_V7C0" name="en_ext_bias" caption="Dsiable Internal Bias Circuit" mask="0x80000000"/>
          <bitfield modes="DEFAULT" name="CALBITS" caption="Calibration Values" mask="0xFFFFFFFF"/>
        </register>
        <register name="EVCTRL" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="Event Control">
          <bitfield name="STARTEI" caption="Start Event conversion input enable" mask="0x1"/>
          <bitfield name="STARTINV" caption="Start Conversion Invert" mask="0x8"/>
          <bitfield name="RESRDYEO" caption="Result Ready Event Out" mask="0x10"/>
        </register>
      </register-group>
      <register-group name="INT" size="0x10">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="CMPHIT" caption="Compare Hit Disable" mask="0x10"/>
          <bitfield name="SOVFL" caption="Synchonizer Overflow Disable" mask="0x80"/>
          <bitfield name="CHRDYC" caption="Core Current Channel Disable" mask="0x100"/>
          <bitfield name="FLTRDY" caption="Filter Ready Disable" mask="0x200"/>
          <bitfield name="CHNERRC" caption="Channel Overwrite Error Disable" mask="0x400"/>
          <bitfield name="EOSRDY" caption="Endo of Scan Disable" mask="0x800"/>
          <bitfield name="CHRDY" caption="Channel Ready Disable" mask="0xFFFF000"/>
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="CMPHIT" caption="Compare Hit Enable" mask="0x10"/>
          <bitfield name="SOVFL" caption="Synchronizer Overflow Enable" mask="0x80"/>
          <bitfield name="CHRDYC" caption="Current Channel Ready Enable" mask="0x100"/>
          <bitfield name="FLTRDY" caption="Filter Ready Enable" mask="0x200"/>
          <bitfield name="CHNERRC" caption="Channel Overwrite Enable" mask="0x400"/>
          <bitfield name="EOSRDY" caption="End of Scan Enable" mask="0x800"/>
          <bitfield name="CHRDY" caption="Channel Ready Enable" mask="0xFFFF0000"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flags">
          <bitfield name="CMPINTID" caption="Compare Channel ID" mask="0xF"/>
          <bitfield name="CMPHIT" caption="Compare Hit" mask="0x10"/>
          <bitfield name="SOVFL" caption="Synchronizer Overflow" mask="0x80"/>
          <bitfield name="CHRDYC" caption="Current Channel Ready" mask="0x100"/>
          <bitfield name="FLTRDY" caption="Filter Ready" mask="0x200"/>
          <bitfield name="CHNERRC" caption="Channel Overwrite Error" mask="0x400"/>
          <bitfield name="EOSRDY" caption="End of Scan Ready" mask="0x800"/>
          <bitfield name="CRDYID" caption="Channel Ready ID" mask="0xF000"/>
          <bitfield name="CHRDY" caption="Channel Ready" mask="0xFFFF0000"/>
        </register>
      </register-group>
      <register-group name="ADC" caption="ADC Controller">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000080" caption="CONTROL A REGISTER">
          <bitfield name="SWRST" caption="SOFTWARE RESET BIT" mask="0x1"/>
          <bitfield name="ENABLE" caption="ENABLE BIT" mask="0x2"/>
          <bitfield name="ANAEN" caption="Analog Enable" mask="0x4"/>
          <bitfield name="AIPMPEN" caption="Charge Pump Enable" mask="0x10"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="CONTROL B REGISTER">
          <bitfield name="ADCHSEL" caption="Software Trigger Channel Select" mask="0xF"/>
          <bitfield name="ADCORSEL" caption="Software Trigger Core Select" mask="0x30"/>
          <bitfield name="RQCNVRT" caption="Request Channel Convert" mask="0x40"/>
          <bitfield name="SAMP" caption="Channel Sample" mask="0x80"/>
          <bitfield name="GSWTRG" caption="Global Software Trigger" mask="0x100"/>
          <bitfield name="LSWTRG" caption="Level Global Trigger" mask="0x200"/>
          <bitfield name="TRGSUSP" caption="Trigger Suspend" mask="0x400"/>
          <bitfield name="SWCNVEN" caption="Software Conversion Enable" mask="0x8000"/>
        </register>
