Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/atdf/PIC32CZ8110CA90208.atdf
    <module name="DRMTCM" id="03770" name2="drm_tcm_ecc_v1" version="1a0" caption="DRM TCM ECC">
      <register-group name="DRMTCM" caption="DRM TCM ECC">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000002" caption="CONTROL ENABLE REGISTER A">
          <bitfield name="SWRST" caption="DRMTCM Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="DRMTCM ECC Enable (ON) bit (default ECC is always enabled)" mask="0x2"/>
        </register>
        <register name="CTRLB" offset="0x4" rw="RW" size="4" initval="0x00070707" caption="CONTROL ENABLE REGISTER B">
          <bitfield name="IERRCNT" caption="ITCM ERROR MAXIMUM COUNT (default 0x7)" mask="0xFF"/>
          <bitfield name="D0ERRCNT" caption="D0TCM ERROR MAXIMUM COUNT (default 0x7)" mask="0xFF00"/>
          <bitfield name="D1ERRCNT" caption="D1TCM ERROR MAXIMUM COUNT (default 0x7)" mask="0xFF0000"/>
          <bitfield name="IWAITSTEN" caption="ITCM ONE WAIT STATE ENABLE BIT" mask="0x1000000"/>
          <bitfield name="DWAITSTEN" caption="D1TCM and D0TCM ONE WAIT STATE ENABLE BIT" mask="0x2000000"/>
          <bitfield name="IERCNTDIS" caption="ITCM ERROR COUNTER DISABLE BIT" mask="0x10000000"/>
          <bitfield name="D0ERCNTDIS" caption="D0TCM ERROR COUNTER DISABLE BIT" mask="0x20000000"/>
          <bitfield name="D1ERCNTDIS" caption="D1TCM ERROR COUNTER DISABLE BIT" mask="0x40000000"/>
        </register>
        <register name="SYNCBUSY" offset="0x8" rw="R" size="4" initval="0x00000000" caption="SYNC BUSY REGISTER">
          <bitfield name="SWRST" caption="Software reset busy bit   --- Synchronizing Busy bit for SWRST" mask="0x1"/>
          <bitfield name="FLTEN" caption="Fault Injection Enabled busy bit   --- Synchronizing Busy bit for FLTEN register (when hard-ware set this bit, no writes are allowed to the FLTCTRL register until after the synchronizing is not busy)." mask="0x2"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="INTERRUPT ENABLE CLR REGISTER">
          <bitfield name="ISERREN" caption="ITCM Single Bit Error Detection Flag bit Disable" mask="0x1"/>
          <bitfield name="IDERREN" caption="ITCM Double Bit Error Detection Flag bit Disable" mask="0x2"/>
          <bitfield name="IECCECNTEN" caption="ITCM ECC Error Count Flag bit Disable" mask="0x4"/>
          <bitfield name="D0SERREN" caption="D0TCM Single Bit Error Detection Flag bit Disable" mask="0x100"/>
          <bitfield name="D0DERREN" caption="D0TCM Double Bit Error Detection Flag bit Disable" mask="0x200"/>
          <bitfield name="D0ECCECNTEN" caption="D0TCM ECC Error Count Flag bit Disable" mask="0x400"/>
          <bitfield name="D1SERREN" caption="D1TCM Single Bit Error Detection Flag bit Disable" mask="0x10000"/>
          <bitfield name="D1DERREN" caption="D1TCM Double Bit Error Detection Flag bit Disable" mask="0x20000"/>
          <bitfield name="D1ECCECNTEN" caption="D1TCM ECC Error Count Flag bit Disable" mask="0x40000"/>
          <bitfield name="FLTCAPEN" caption="Fault Capture interrupt enable bit Disable" mask="0x1000000"/>
        </register>
        <register name="INTENSET" offset="0x10" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="INTERRUPT ENABLE SET REGISTER">
          <bitfield name="ISERREN" caption="ITCM Single Bit Error Detection Flag bit Enable" mask="0x1"/>
          <bitfield name="IDERREN" caption="ITCM Double Bit Error Detection Flag bit Enable" mask="0x2"/>
          <bitfield name="IECCECNTEN" caption="ITCM ECC Error Count Flag bit Enable" mask="0x4"/>
          <bitfield name="D0SERREN" caption="D0TCM Single Bit Error Detection Flag bit Enable" mask="0x100"/>
          <bitfield name="D0DERREN" caption="D0TCM Double Bit Error Detection Flag bit Enable" mask="0x200"/>
          <bitfield name="D0ECCECNTEN" caption="D0TCM ECC Error Count Flag bit Enable" mask="0x400"/>
          <bitfield name="D1SERREN" caption="D1TCM Single Bit Error Detection Flag bit Enable" mask="0x10000"/>
          <bitfield name="D1DERREN" caption="D1TCM Double Bit Error Detection Flag bit Enable" mask="0x20000"/>
          <bitfield name="D1ECCECNTEN" caption="D1TCM ECC Error Count Flag bit Enable" mask="0x40000"/>
          <bitfield name="FLTCAPEN" caption="Fault Capture interrupt enable bit Enable" mask="0x1000000"/>
        </register>
        <register name="INTFLAG" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="INTERRUPT FLAG REGISTER">
          <bitfield name="ISERR" caption="ITCM Single Bit Error Detection Flag" mask="0x1"/>
          <bitfield name="IDERR" caption="ITCM Double Bit Error Detection Flag" mask="0x2"/>
          <bitfield name="IECCECNT" caption="ITCM ECC Error Count Flag" mask="0x4"/>
          <bitfield name="D0SERR" caption="D0TCM Single Bit Error Detection Flag" mask="0x100"/>
          <bitfield name="D0DERR" caption="D0TCM Double Bit Error Detection Flag" mask="0x200"/>
          <bitfield name="D0ECCECNT" caption="D0TCM ECC Error Count Flag" mask="0x400"/>
          <bitfield name="D1SERR" caption="D1TCM Single Bit Error Detection Flag" mask="0x10000"/>
          <bitfield name="D1DERR" caption="D1TCM Double Bit Error Detection Flag" mask="0x20000"/>
          <bitfield name="D1ECCECNT" caption="D1TCM ECC Error Count Flag" mask="0x40000"/>
          <bitfield name="FLTCAP" caption="Fault Capture interrupt" mask="0x1000000"/>
        </register>
        <register name="FLTCTRL" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="FAULT INJECTION CONTROL REGISTER">
          <bitfield name="FLTEN" caption="Fault Injection Enabled" mask="0x2"/>
          <bitfield name="FLTMD" caption="Fault Mode Control" mask="0x3000"/>
        </register>
        <register name="IFLTPTR" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="ITCM FAULT INJECTION POINTER REGISTER">
          <bitfield name="FLT1PTR" caption="ECC Fault injection Bit position pointer (for single bit error)." mask="0x7F"/>
          <bitfield name="FLT2PTR" caption="ECC Fault injection Bit position pointer (for double bit error)." mask="0x7F0000"/>
        </register>
        <register name="IFLTADR" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="ITCM FAULT INJECTION ADDRESS REGISTER">
          <bitfield name="IFLTADR" caption="Instruction ITCM ECC Fault Injection, Address Match Com-pare bits." mask="0x1FFFF"/>
        </register>
        <register name="IFLTCAP" offset="0x24" rw="R" size="4" initval="0x00000000" caption="ITCM FAULT ERROR CAPTURE ADDRESS REGISTER">
          <bitfield name="FLTADR" caption="Instruction TCM ECC Fault Address bits which caused the ECC Error." mask="0x1FFFF"/>
          <bitfield name="ITCMMASTER" caption="Master ID of the requester of the current Error access." mask="0xF0000000"/>
        </register>
        <register name="IFLTPAR" offset="0x28" rw="R" size="4" initval="0x00000000" caption="ITCM FAULT PARITY REGISTER">
          <bitfield name="SECIN" caption="Single Error Parity Bits from ITCM" mask="0xFF"/>
        </register>
        <register name="IFLTSYN" offset="0x2C" rw="R" size="4" initval="0x00000000" caption="ITCM FAULT ECC SYNDROME REGISTER">
          <bitfield name="SECSYN" caption="Single Error Syndrome" mask="0xFF"/>
          <bitfield name="ERR1" caption="Single Bit Error" mask="0x4000"/>
          <bitfield name="ERR2" caption="Double bit Error" mask="0x8000"/>
        </register>
        <register name="DFLTPTR" offset="0x30" rw="RW" size="4" initval="0x00000000" caption="DTCM FAULT INJECTION POINTER REGISTER">
          <bitfield name="FLT1PTR" caption="ECC Fault injection Bit position pointer (for single bit error)." mask="0x3F"/>
          <bitfield name="FLT2PTR" caption="ECC Fault injection Bit position pointer (for double bit error)." mask="0x3F0000"/>
        </register>
        <register name="DFLTADR" offset="0x34" rw="RW" size="4" initval="0x00000000" caption="DTCM FAULT INJECTION ADDRESS REGISTER">
          <bitfield name="FLTADR" caption="Data TCM ECC Fault Injection, Address Match Compare bits." mask="0x1FFFF"/>
          <bitfield name="D1D0EN" caption="Fault Injection D1 or D0 Address Enable." mask="0x80000000"/>
        </register>
        <register name="D0FLTCAP" offset="0x38" rw="R" size="4" initval="0x00000000" caption="D0TCM FAULT ERROR CAPTURE ADDRESS REGISTER">
          <bitfield name="FLTADR" caption="Data 0 TCM ECC Fault Address bits which caused the ECC Error." mask="0x1FFFF"/>
          <bitfield name="TCMMASTER" caption="Master ID of the requester of the current Error access." mask="0xF0000000"/>
        </register>
        <register name="D0FLTPAR" offset="0x3C" rw="R" size="4" initval="0x00000000" caption="D0TCM FAULT PARITY REGISTER">
          <bitfield name="SECIN" caption="Single Error Parity Bits from D0TCM" mask="0x7F"/>
        </register>
        <register name="D0FLTSYN" offset="0x40" rw="R" size="4" initval="0x00000000" caption="D0TCM FAULT ECC SYNDROME REGISTER">
          <bitfield name="SECSYN" caption="Single Error Syndrome" mask="0x7F"/>
          <bitfield name="ERR1" caption="Single Bit Error" mask="0x4000"/>
          <bitfield name="ERR2" caption="Double bit Error" mask="0x8000"/>
        </register>
