Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/atdf/PIC32CZ8110CA90208.atdf
        <register name="D1FLTCAP" offset="0x44" rw="R" size="4" initval="0x00000000" caption="D1TCM FAULT ERROR CAPTURE ADDRESS REGISTER">
          <bitfield name="FLTADR" caption="Data 1 TCM ECC Fault Address bits which caused the ECC Error." mask="0x1FFFF"/>
          <bitfield name="D1TCMMASTER" caption="Master ID of the requester of the current Error access." mask="0xF0000000"/>
        </register>
        <register name="D1FLTPAR" offset="0x48" rw="R" size="4" initval="0x00000000" caption="D1TCM FAULT PARITY REGISTER">
          <bitfield name="SECIN" caption="Single Error Parity Bits from D1TCM" mask="0x7F"/>
        </register>
        <register name="D1FLTSYN" offset="0x4C" rw="R" size="4" initval="0x00000000" caption="D1TCM FAULT ECC SYNDROME REGISTER">
          <bitfield name="SECSYN" caption="Single Error Syndrome" mask="0x7F"/>
          <bitfield name="ERR1" caption="Single Bit Error" mask="0x4000"/>
          <bitfield name="ERR2" caption="Double bit Error" mask="0x8000"/>
        </register>
      </register-group>
    </module>
    <module name="DSU" id="03716" name2="icd_dsu_u2810_v2" version="2a0" caption="Device Service Unit">
      <register-group name="DSU" caption="Device Service Unit">
        <register name="CTRL" offset="0x0" rw="W" size="4" initval="0x00000000" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="CMD" caption="Command Register" mask="0xFFFF0000" values="CTRL__CMD"/>
        </register>
        <register name="ADDR" offset="0x4" rw="RW" size="4" initval="0x00000000" caption="Address">
          <mode name="DEFAULT"/>
          <mode name="MBIST"/>
          <bitfield modes="MBIST" name="AMOD" caption="Access Mode" mask="0x3" values="ADDR__AMOD"/>
          <bitfield name="ADDR" caption="Address" mask="0xFFFFFFFC"/>
        </register>
        <register name="LENGTH" offset="0x8" rw="RW" size="4" initval="0x00000000" caption="Length">
          <bitfield name="LENGTH" caption="Length" mask="0xFFFFFFFC"/>
        </register>
        <register name="DATA" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Data">
          <mode name="DEFAULT"/>
          <mode name="MBIST"/>
          <bitfield modes="MBIST" name="STATE" caption="MBIST state" mask="0x1F" values="DATA__STATE"/>
          <bitfield modes="MBIST" name="INDEX" caption="MBIST bit Index" mask="0x1F00"/>
          <bitfield modes="DEFAULT" name="DATA" caption="Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="CFG" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Configuration">
          <bitfield name="DCCDMALEVEL0" caption="DMA Trigger 0 Level" mask="0x1" values="CFG__DCCDMALEVEL"/>
          <bitfield name="DCCDMALEVEL1" caption="DMA Trigger 1 Level" mask="0x2" values="CFG__DCCDMALEVEL"/>
          <bitfield name="MBFI" caption="Enables the Memory Bist Fault Injection" mask="0x4"/>
          <bitfield name="MISC" caption="Device Specific Configuration Register" mask="0xFFFFFF00"/>
        </register>
        <register name="MBFI0" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Memory Bist Fault Injection 0">
          <bitfield name="BIDX" caption="Bit Index of injected fault" mask="0x1F"/>
          <bitfield name="AMMOD" caption="Address matching mode" mask="0x40" values="MBFI0__AMMOD"/>
          <bitfield name="FTYPE" caption="Fault type" mask="0x80" values="MBFI0__FTYPE"/>
          <bitfield name="AMMSK" caption="Address matching Mask (Word address)" mask="0xFFFFFF00"/>
        </register>
        <register name="MBFI1" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="Memory Bist Fault Injection 1">
          <bitfield name="ADDR" caption="Word Address" mask="0xFFFFFFFC"/>
        </register>
        <register name="STATUSA" offset="0x100" rw="RW" size="4" initval="0x00000000" caption="Status A">
          <bitfield name="DONE" caption="Done" mask="0x1"/>
          <bitfield name="FAIL" caption="Failure" mask="0x2"/>
          <bitfield name="BERR" caption="Bus Error" mask="0x4"/>
          <bitfield name="PERR" caption="Protection Error" mask="0x8"/>
          <bitfield name="CRSTEXT0" caption="CPU 0 Reset Phase Extension" mask="0x100"/>
          <bitfield name="CRSTEXT1" caption="CPU 1 Reset Phase Extension" mask="0x200"/>
          <bitfield name="CRSTEXT2" caption="CPU 2 Reset Phase Extension" mask="0x400"/>
          <bitfield name="CRSTEXT3" caption="CPU 3 Reset Phase Extension" mask="0x800"/>
          <bitfield name="BREXT0" caption="BootRom 0 Phase Extension" mask="0x10000"/>
          <bitfield name="BREXT1" caption="BootRom 1 Phase Extension" mask="0x20000"/>
          <bitfield name="BREXT2" caption="BootRom 2 Phase Extension" mask="0x40000"/>
          <bitfield name="BREXT3" caption="BootRom 3 Phase Extension" mask="0x80000"/>
        </register>
        <register name="STATUSB" offset="0x104" rw="R" size="4" initval="0x00000000" caption="Status B">
          <bitfield name="BCCD0" caption="Boot ROM Communication Channel 0 Dirty" mask="0x1"/>
          <bitfield name="BCCD1" caption="Boot ROM Communication Channel 1 Dirty" mask="0x2"/>
          <bitfield name="DCCD0" caption="Debug Communication Channel 0 Dirty" mask="0x4"/>
          <bitfield name="DCCD1" caption="Debug Communication Channel 1 Dirty" mask="0x8"/>
          <bitfield name="DBGPRES" caption="Debugger Present" mask="0x100"/>
          <bitfield name="HPE" caption="Hot-Plugging Enable" mask="0x400"/>
          <bitfield name="APDIS" caption="ARM Access Ports Disabled" mask="0x800"/>
        </register>
        <register name="STATUSC" offset="0x108" rw="R" size="4" initval="0x00000000" caption="Status C">
          <bitfield name="STATE" caption="Core State" mask="0x1F" values="STATUSC__STATE"/>
          <bitfield name="INDEX" caption="MBIST, MSA, PMSA bit Index" mask="0x1F00"/>
        </register>
        <register name="BCC" offset="0x110" rw="RW" size="4" count="2" initval="0x00000000" caption="Boot ROM Communication Channel x">
          <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="DCC" offset="0x118" rw="RW" size="4" count="2" initval="0x00000000" caption="Debug Communication Channel x">
          <bitfield name="DATA" caption="Data" mask="0xFFFFFFFF"/>
        </register>
        <register name="DID" offset="0x120" rw="R" size="4" initval="0x0920C053" caption="Device Identification">
          <bitfield name="MARKER" caption="Marker Bit" mask="0x1"/>
          <bitfield name="MANID" caption="Manufacturer ID" mask="0xFFE"/>
          <bitfield name="DEVSEL" caption="Device Select" mask="0xFF000"/>
          <bitfield name="PRODUCT" caption="Product" mask="0xFF00000"/>
          <bitfield name="REVISION" caption="Revision" mask="0xF0000000"/>
        </register>
        <register name="DAL" offset="0x124" rw="R" size="4" initval="0x00000000" caption="Debugger Access Level">
          <bitfield name="CPU0" caption="Per CPU Debugger Access Level" mask="0x3" values="DAL__CPU"/>
          <bitfield name="CPU1" caption="Per CPU Debugger Access Level" mask="0xC" values="DAL__CPU"/>
          <bitfield name="CPU2" caption="Per CPU Debugger Access Level" mask="0x30" values="DAL__CPU"/>
          <bitfield name="CPU3" caption="Per CPU Debugger Access Level" mask="0xC0" values="DAL__CPU"/>
        </register>
        <register name="ENTRY" offset="0x1000" rw="R" size="4" count="8" initval="0x00000000" caption="Coresight ROM Table Entry x">
          <bitfield name="EPRES" caption="Entry Present" mask="0x1"/>
          <bitfield name="FMT" caption="Format" mask="0x2"/>
          <bitfield name="ADDOFF" caption="Address Offset" mask="0xFFFFF000"/>
        </register>
