Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/atdf/PIC32CZ8110CA90208.atdf
      <value-group name="PHY00__RXPHSSEL">
        <value name="EARLIEST" caption="Earliest phase" value="0x0"/>
        <value name="LATEST" caption="Latest phase" value="0x7"/>
      </value-group>
    </module>
    <module name="WDT" id="03611" name2="wdt_u2251_v2" version="2b0" caption="Watchdog Timer">
      <register-group name="WDT" caption="Watchdog Timer">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="WEN" caption="Watchdog Timer Window Mode Enable" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run During Standby" mask="0x40"/>
          <bitfield name="ALWAYSON" caption="Always-On" mask="0x80"/>
        </register>
        <register name="CONFIG" offset="0x1" rw="RW" size="1" initval="0xBB" caption="Configuration">
          <bitfield name="PER" caption="Time-Out Period" mask="0xF" values="CONFIG__PER"/>
          <bitfield name="WINDOW" caption="Window Mode Time-Out Period" mask="0xF0" values="CONFIG__WINDOW"/>
        </register>
        <register name="EWCTRL" offset="0x2" rw="RW" size="1" initval="0x0B" caption="Early Warning Interrupt Control">
          <bitfield name="EWOFFSET" caption="Early Warning Interrupt Time Offset" mask="0xF" values="EWCTRL__EWOFFSET"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x5" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="EW" caption="Early Warning Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x6" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="EW" caption="Early Warning" mask="0x1"/>
        </register>
        <register name="SYNCBUSY" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="ENABLE" caption="Enable Synchronization Busy" mask="0x2"/>
          <bitfield name="WEN" caption="Window Enable Synchronization Busy" mask="0x4"/>
          <bitfield name="RUNSTDBY" caption="Run During Standby Synchronization Busy" mask="0x8"/>
          <bitfield name="ALWAYSON" caption="Always-On Synchronization Busy" mask="0x10"/>
          <bitfield name="CLEAR" caption="Clear Synchronization Busy" mask="0x20"/>
        </register>
        <register name="CLEAR" offset="0xC" rw="W" access="WSYNC" size="1" initval="0x00" caption="Clear">
          <bitfield name="CLEAR" caption="Watchdog Clear" mask="0xFF" values="CLEAR__CLEAR"/>
        </register>
      </register-group>
      <value-group name="CONFIG__PER">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="CONFIG__WINDOW">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="EWCTRL__EWOFFSET">
        <value name="CYC8" caption="8 clock cycles" value="0x0"/>
        <value name="CYC16" caption="16 clock cycles" value="0x1"/>
        <value name="CYC32" caption="32 clock cycles" value="0x2"/>
        <value name="CYC64" caption="64 clock cycles" value="0x3"/>
        <value name="CYC128" caption="128 clock cycles" value="0x4"/>
        <value name="CYC256" caption="256 clock cycles" value="0x5"/>
        <value name="CYC512" caption="512 clock cycles" value="0x6"/>
        <value name="CYC1024" caption="1024 clock cycles" value="0x7"/>
        <value name="CYC2048" caption="2048 clock cycles" value="0x8"/>
        <value name="CYC4096" caption="4096 clock cycles" value="0x9"/>
        <value name="CYC8192" caption="8192 clock cycles" value="0xA"/>
        <value name="CYC16384" caption="16384 clock cycles" value="0xB"/>
      </value-group>
      <value-group name="CLEAR__CLEAR">
        <value name="KEY" caption="Clear Key" value="0xA5"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="PIC32CZCA208" caption="PIC32CZCA208">
      <pin position="1" pad="PA00"/>
      <pin position="2" pad="PA01"/>
      <pin position="3" pad="PA02"/>
      <pin position="4" pad="PA03"/>
      <pin position="5" pad="PA04"/>
      <pin position="6" pad="PE04"/>
      <pin position="7" pad="VSS1"/>
      <pin position="8" pad="VDDIO"/>
      <pin position="9" pad="PA05"/>
      <pin position="10" pad="PA06"/>
      <pin position="11" pad="PA30"/>
      <pin position="12" pad="PA31"/>
      <pin position="13" pad="PA21"/>
      <pin position="14" pad="PA22"/>
      <pin position="15" pad="PA23"/>
      <pin position="16" pad="PE00"/>
      <pin position="17" pad="PE01"/>
      <pin position="18" pad="PE02"/>
      <pin position="19" pad="PE05"/>
      <pin position="20" pad="VSS2"/>
      <pin position="21" pad="VDDIO"/>
      <pin position="22" pad="PE06"/>
      <pin position="23" pad="PE07"/>
      <pin position="24" pad="PA07"/>
      <pin position="25" pad="PA08"/>
      <pin position="26" pad="PA09"/>
      <pin position="27" pad="PE08"/>
      <pin position="28" pad="PE09"/>
      <pin position="29" pad="PE10"/>
      <pin position="30" pad="PE11"/>
      <pin position="31" pad="PA24"/>
      <pin position="32" pad="PA25"/>
      <pin position="33" pad="PE03"/>
      <pin position="34" pad="VSS3"/>
      <pin position="35" pad="VDDIO"/>
      <pin position="36" pad="PA10"/>
      <pin position="37" pad="PA11"/>
      <pin position="38" pad="PA26"/>
      <pin position="39" pad="PA27"/>
      <pin position="40" pad="PA12"/>
      <pin position="41" pad="PA13"/>
      <pin position="42" pad="PA14"/>
      <pin position="43" pad="PA28"/>
      <pin position="44" pad="PA29"/>
      <pin position="45" pad="PA15"/>
      <pin position="46" pad="VSS4"/>
      <pin position="47" pad="VDDIO"/>
      <pin position="48" pad="PA16"/>
      <pin position="49" pad="PA17"/>
      <pin position="50" pad="PA18"/>
      <pin position="51" pad="PA19"/>
      <pin position="52" pad="PA20"/>
      <pin position="53" pad="PB00"/>
      <pin position="54" pad="PB01"/>
      <pin position="55" pad="PB02"/>
      <pin position="56" pad="PB03"/>
      <pin position="57" pad="PB18"/>
      <pin position="58" pad="PB19"/>
      <pin position="59" pad="PB20"/>
      <pin position="60" pad="AVSS"/>
      <pin position="61" pad="AVDD"/>
      <pin position="62" pad="PB04"/>
      <pin position="63" pad="PB05"/>
      <pin position="64" pad="VDDIO"/>
      <pin position="65" pad="PDMEN"/>
      <pin position="66" pad="PB21"/>
      <pin position="67" pad="PB06"/>
      <pin position="68" pad="PB22"/>
      <pin position="69" pad="PB23"/>
      <pin position="70" pad="PB07"/>
      <pin position="71" pad="PB08"/>
      <pin position="72" pad="PF01"/>
      <pin position="73" pad="PF00"/>
      <pin position="74" pad="PB27"/>
      <pin position="75" pad="VDDIO"/>
      <pin position="76" pad="VSS6"/>
      <pin position="77" pad="PF02"/>
      <pin position="78" pad="PF03"/>
      <pin position="79" pad="PF04"/>
      <pin position="80" pad="PB28"/>
      <pin position="81" pad="PF05"/>
      <pin position="82" pad="PB09"/>
      <pin position="83" pad="PB10"/>
      <pin position="84" pad="PB11"/>
      <pin position="85" pad="PB29"/>
      <pin position="86" pad="VDDIO"/>
      <pin position="87" pad="VSS7"/>
      <pin position="88" pad="PF06"/>
      <pin position="89" pad="PF07"/>
      <pin position="90" pad="PF08"/>
      <pin position="91" pad="PB30"/>
      <pin position="92" pad="PB31"/>
      <pin position="93" pad="PB24"/>
      <pin position="94" pad="PB25"/>
      <pin position="95" pad="PB26"/>
      <pin position="96" pad="PB12"/>
      <pin position="97" pad="VDDREG"/>
      <pin position="98" pad="VSS"/>
      <pin position="99" pad="VDDIO"/>
      <pin position="100" pad="PB13"/>
      <pin position="101" pad="PB14"/>
      <pin position="102" pad="PB15"/>
      <pin position="103" pad="PB16"/>
      <pin position="104" pad="PB17"/>
      <pin position="105" pad="PG04"/>
      <pin position="106" pad="PC00"/>
      <pin position="107" pad="PC01"/>
      <pin position="108" pad="PC02"/>
      <pin position="109" pad="PC03"/>
      <pin position="110" pad="PC04"/>
      <pin position="111" pad="VDDF"/>
      <pin position="112" pad="VSSF"/>
      <pin position="113" pad="PC05"/>
      <pin position="114" pad="PC06"/>
      <pin position="115" pad="PC21"/>
      <pin position="116" pad="PC22"/>
      <pin position="117" pad="PC07"/>
      <pin position="118" pad="PC08"/>
      <pin position="119" pad="PC23"/>
      <pin position="120" pad="PC24"/>
      <pin position="121" pad="PC09"/>
      <pin position="122" pad="PC25"/>
      <pin position="123" pad="VDDIO"/>
      <pin position="124" pad="VSS10"/>
      <pin position="125" pad="PC30"/>
      <pin position="126" pad="PC31"/>
      <pin position="127" pad="PC26"/>
      <pin position="128" pad="PG00"/>
      <pin position="129" pad="PG05"/>
      <pin position="130" pad="PG06"/>
      <pin position="131" pad="PG07"/>
      <pin position="132" pad="PG08"/>
      <pin position="133" pad="PG01"/>
      <pin position="134" pad="PG02"/>
      <pin position="135" pad="PC10"/>
      <pin position="136" pad="PC11"/>
      <pin position="137" pad="VDDIO"/>
      <pin position="138" pad="VSS11"/>
      <pin position="139" pad="PG09"/>
      <pin position="140" pad="PG10"/>
      <pin position="141" pad="PG11"/>
      <pin position="142" pad="PC27"/>
      <pin position="143" pad="PG03"/>
      <pin position="144" pad="PC28"/>
      <pin position="145" pad="PC12"/>
      <pin position="146" pad="PC13"/>
      <pin position="147" pad="PC29"/>
      <pin position="148" pad="PC14"/>
      <pin position="149" pad="PC15"/>
      <pin position="150" pad="VDDF"/>
      <pin position="151" pad="VSSF"/>
      <pin position="152" pad="RESET_N"/>
      <pin position="153" pad="PC17"/>
      <pin position="154" pad="PC18"/>
      <pin position="155" pad="PC19"/>
      <pin position="156" pad="PC20"/>
      <pin position="157" pad="USBDP0"/>
      <pin position="158" pad="USBDM0"/>
      <pin position="159" pad="USBID0"/>
      <pin position="160" pad="VCCA3P30"/>
      <pin position="161" pad="VSSUSBA"/>
      <pin position="162" pad="VBUS0"/>
      <pin position="163" pad="USBRBIAS0"/>
      <pin position="164" pad="VSS13"/>
      <pin position="165" pad="VDDREG"/>
      <pin position="166" pad="USBDP1"/>
      <pin position="167" pad="USBDM1"/>
      <pin position="168" pad="USBID1"/>
      <pin position="169" pad="VCCA3P31"/>
      <pin position="170" pad="VSSUSBD"/>
      <pin position="171" pad="VBUS1"/>
      <pin position="172" pad="USBRBIAS1"/>
      <pin position="173" pad="PD00"/>
      <pin position="174" pad="PD01"/>
      <pin position="175" pad="PD24"/>
      <pin position="176" pad="PD25"/>
      <pin position="177" pad="VSS14"/>
      <pin position="178" pad="VDDIO"/>
      <pin position="179" pad="PD13"/>
      <pin position="180" pad="PD23"/>
      <pin position="181" pad="PD14"/>
      <pin position="182" pad="PD02"/>
      <pin position="183" pad="PD03"/>
      <pin position="184" pad="PD26"/>
      <pin position="185" pad="PD27"/>
      <pin position="186" pad="PD28"/>
      <pin position="187" pad="PD29"/>
      <pin position="188" pad="VSS15"/>
      <pin position="189" pad="VDDIO"/>
      <pin position="190" pad="PD15"/>
      <pin position="191" pad="PD16"/>
      <pin position="192" pad="PD17"/>
      <pin position="193" pad="PD04"/>
      <pin position="194" pad="PD18"/>
      <pin position="195" pad="PD19"/>
      <pin position="196" pad="PD05"/>
      <pin position="197" pad="PD06"/>
      <pin position="198" pad="PD20"/>
      <pin position="199" pad="PD21"/>
      <pin position="200" pad="PD07"/>
      <pin position="201" pad="VDDREG"/>
      <pin position="202" pad="VSS"/>
      <pin position="203" pad="VDDIO"/>
      <pin position="204" pad="PD08"/>
      <pin position="205" pad="PD09"/>
      <pin position="206" pad="PD10"/>
      <pin position="207" pad="PD11"/>
      <pin position="208" pad="PD12"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
